In [50]:
import pandas as pd
from IPython.display import display

#simple dataset of people
data = {
    'Name' : ['Tom', 'Sophie', 'Charlie', 'Laura'],
    'Location' : ['Leamington Spa', 'Leamington Spa', 'Coventry', 'Kenilworth'],
    'Gender' : ['Male', 'Female', 'Female', 'Female'],
    'Age' : ['30', '26', '25', '31'],
    'Single' : ['True', 'True', 'False', 'True']
}

#Data Frames are similar to the R Data Frame, it's a data structure.
## You can use SQL, Excel, and CSV files and can be extended to more SQL types
df = pd.DataFrame(data)

## IPython.display allows "pretty printg" of dataframes
## in the Jupyter notebook
display(df)

  Age  Gender        Location     Name Single
0  30    Male  Leamington Spa      Tom   True
1  26  Female  Leamington Spa   Sophie   True
2  25  Female        Coventry  Charlie  False
3  31  Female      Kenilworth    Laura   True

## We're really only interest in all the single ladies.

In [51]:
# Select all rows that have single ladies in.
display(df[df.Single == 'True'])

  Age  Gender        Location    Name Single
0  30    Male  Leamington Spa     Tom   True
1  26  Female  Leamington Spa  Sophie   True
3  31  Female      Kenilworth   Laura   True

In [52]:
display(df[df.Gender == 'Female'])

  Age  Gender        Location     Name Single
1  26  Female  Leamington Spa   Sophie   True
2  25  Female        Coventry  Charlie  False
3  31  Female      Kenilworth    Laura   True

In [53]:
female = df.Gender == 'Female'
single = df.Single == 'True'
display(df[female & single])

  Age  Gender        Location    Name Single
1  26  Female  Leamington Spa  Sophie   True
3  31  Female      Kenilworth   Laura   True

( ͡° ͜ʖ ͡°)